{"pageProps":{"posts":[{"slugPartial":"user-story-mapping-book","filename":"user-story-mapping-book.md","title":"User Story Mapping Book","excerpt":"Wandering through the \"available now\" books on my eBook app for my library and came across this one.  Honestly had low-ish expectations entirely based on the age of the book but it's been a good refresher and focus-bringers.","date":"2025-05-27","categories":["development","book"],"ogImage":{"url":"posts/posts/thumbnail.jpg"},"images":[],"content":"<p><strong>Disclaimer: this book review is still in-progress and thus the analysis may seem to end abrubptly.</strong></p>\n<p>While I've been \"doing agile\" for a long time now it is always good to refresh yourself on the roots of your processes.  This book is well written and still very useful in terms of guidance and best practices.  I'm sure if I read this every year I'd pull out different quotes and learnings but the fact that any software development book is still relevant a decade in is very indicative of its value and the transformative nature of these concepts.</p>\n<h2>Output vs Impact</h2>\n<p>There is a never-ending struggle of software development teams being asked to \"go faster\" and \"do more\" but I found the section about \"good teams vs bad teams\" (my renaming of the section) to be an intriguing angle on this struggle.</p>\n<blockquote>\n<p>One of the common misconceptions in software development is that we're trying to get more output faster.  Because it would make sense that if there was too much to do, doing it faster would help, right?  But if you get the game right, you will realize that your job is not to build <em>more</em>--it's to build <em>less</em>.</p>\n</blockquote>\n<blockquote>\n<p>At the end of the day, your job is to <em>minimize</em> output, and <em>maximize</em> outcome and impact.</p>\n</blockquote>\n<p>We can always ship more code and we can do things to ship more code faster.  Increasingly I see posts about AI-driven development being a game-changer in this way.  AI can <em>certainly</em> help us ship more code faster, of that I have no doubt.  However these quotes are spot-on in that we shouldn't be focused on the quantity of output.  Whether we measure in lines of code, issues, closed, deployments made, or any other GitLab-driven metric we're stuck without the whole picture.  The <em>quality</em> of the product that comes out of those metrics is what truly matters.  And that is a very difficult metric to track and correlate.</p>\n","slug":"/posts/user-story-mapping-book"},{"slugPartial":"camping-car-storage","filename":"camping-car-storage","title":"Camping Car Storage","excerpt":"We do a big road trip with tent camping every year and it was time to build something custom.","date":"2025-05-25","categories":["wood","camping"],"ogImage":{"url":"posts/camping-car-storage/thumbnail.jpg"},"images":[{"ref":"![](initial-prototype.jpg)","altText":"A black SUV's trunk is open, showing a cooler and two wooden crates inside.","filename":"initial-prototype.jpg","title":""},{"ref":"![](drawers-prototype.jpg)","altText":"The back of an SUV with a Coleman cooler and two crates in the trunk.","filename":"drawers-prototype.jpg","title":""},{"ref":"![](realish-drawers.jpg)","altText":"The back of an SUV with a Coleman cooler and various camping supplies on display.","filename":"realish-drawers.jpg","title":""}],"content":"<p>For essentially as long as we've had our Outback I've thought about building something that fits nicely into the back to make our camping setup more organized and just how we need it.  We've had a very similar setup for that entire time that is comprised for four things:</p>\n<ol>\n<li>Our Coleman stainless steel cooler,</li>\n<li>Some cheap Sterilite drawers from Target that serves as our drawers and cabinets for pots, pans, silverware, towels, dishes, and whatever else we throw in there,</li>\n<li>A nearly-discarded drawer box from our kitchen remodel that wasn't quite the right size that serves as our food box, and</li>\n<li>All sorts of random bags, totes, boxes, and other ways to cram stuff into the back of the car.</li>\n</ol>\n<p>While some custom-made storage isn't going to solve for #1 (or #4) it could make an improvement on #2 and #3 right off the bat and maybe even start to infringe upon #4's territory as we refine it to our needs.</p>\n<h2>Initial Prototype</h2>\n<p>While I've been big on <em>software prototypes</em> for my whole career the idea of <em>woodworking prototypes</em> is still pretty new for me.  It started when we were configuring the bathroom I was going to put into the basement and I needed a to-scale toilet, vanity, and shower.  For this one it was just to get a sense for how to work around the liner that protects the floor of the back area as well as give more clear visual cues for how this might all start to go for sizing and the angle of the seatback.</p>\n<p><img src=\"/posts/camping-car-storage/initial-prototype.jpg\" alt=\"A black SUV&#x27;s trunk is open, showing a cooler and two wooden crates inside.\"></p>\n<h2>Drawers Prototype</h2>\n<p>Next step was to break that down a bit into something representing the individual \"cabinets\" and the drawers that our stuff would go into.  This helped to further shape the mental model of how this would all fit and gave me something tangible to see for what all we could fit into this space and how it would work together.</p>\n<p><img src=\"/posts/camping-car-storage/drawers-prototype.jpg\" alt=\"The back of an SUV with a Coleman cooler and two crates in the trunk.\"></p>\n<p>The most important thing this identified for me was that the cooler couldn't sit in the middle.  None of these drawers were going to be large enough to fit the pots and pans (which are the largest single thing to store).  So any real implementaiton would need to include a larger drawer on one side or the other to fit those.  This would also make it so the drawers on that side are also large enough for the plates and bowls.</p>\n<h2>Real-ish Drawers</h2>\n<p>Building off that I felt like I had a decent idea of how this could all work and was starting to run low on time before our 2025 trip so I kind of just went for it.  I built some real drawers and got actual drawer slides.  These are push-to-open drawer slides so they will stay closed while we're driving (a problem we had with the plastic drawers that required a bungee which was not fun to deal with).</p>\n<p>This was the first iteration that got revealed to the family (most importantly Trephaena) and the reviews were pretty positive.  The cooler drawer is pretty sweet and the overall idea is great.  One drawer was being annoying to get to latch in place and the left drawers are pretty tight but otherwise it was definitely a success.</p>\n<p><img src=\"/posts/camping-car-storage/realish-drawers.jpg\" alt=\"The back of an SUV with a Coleman cooler and various camping supplies on display.\"></p>\n<h2>Work-in-Progress</h2>\n<p>We're discussing what more we want to try to do before we leave (two weeks from today) so we'll see where we land on that.  For now this is going to come with us and we'll test it on the road.  Part of my whole reason for doing this is to learn and iterate on each trip so I have no allusions this is going to be perfect but I'm super excited I finally started and it's going reasonably well so far.</p>\n","slug":"/posts/camping-car-storage"},{"slugPartial":"dining-table-refinish","filename":"dining-table-refinish","title":"Dining Table Refinish","excerpt":"A long overdue project to take our generations-old dining room table and prepare it for decades more use.","date":"2025-05-21","categories":["wood"],"coverImage":"posts/dining-table-refinish/thumbnail.jpg","coverImageAltText":"A round wood table with three chairs is placed in a messy dining room.","ogImage":{"url":"posts/dining-table-refinish/thumbnail.jpg"},"images":[{"ref":"![](old-finish-with-cookies.jpg)","altText":"A wooden table set with baked cookies, a mixing bowl, and other baking supplies.","filename":"old-finish-with-cookies.jpg","title":""},{"ref":"![](temporary-table.jpg \"Temporary Table\")","altText":"An oval plywood tabletop on sawhorses sits in a messy workshop with various supplies around it.","filename":"temporary-table.jpg","title":"Temporary Tabl"},{"ref":"![](underside-half-stripped.jpg)","altText":"A round wooden table with metal brackets and hardware is disassembled on a wooden pallet.","filename":"underside-half-stripped.jpg","title":""},{"ref":"![](underside-no-hardware.jpg)","altText":"Two halves of a wooden table top sit on sawhorses in a garage or workshop.","filename":"underside-no-hardware.jpg","title":""},{"ref":"![](apron-not-stripped.jpg)","altText":"Two curved wooden pieces rest on a workbench beside a sander, indicating ongoing woodworking.","filename":"apron-not-stripped.jpg","title":""},{"ref":"![](legs-one-stripped.jpg)","altText":"Four pieces of cut wood, three stained and one not, lay on a work bench.","filename":"legs-one-stripped.jpg","title":""},{"ref":"![](midway-progress.jpg)","altText":"An unfinished oval wooden table on a stand in a cluttered garage workshop area.","filename":"midway-progress.jpg","title":""},{"ref":"![](sanding-complete.jpg)","altText":"Several wood boards and shapes on a work bench, with various tools in the background.","filename":"sanding-complete.jpg","title":""},{"ref":"![](finish-applied.jpg)","altText":"A disassembled wooden table with three removable leaves in front of a blue car.","filename":"finish-applied.jpg","title":""},{"ref":"![](finished-top-view.jpg)","altText":"A round wooden table is shown with a white chair underneath it.","filename":"finished-top-view.jpg","title":""},{"ref":"![](complete-and-reinstalled.jpg)","altText":"An oval wooden dining table with three white chairs pushed in around it.","filename":"complete-and-reinstalled.jpg","title":""},{"altText":"A round wood table with three chairs is placed in a messy dining room.","filename":"thumbnail.jpg","title":"Thumbnail"}],"content":"<p>Our dining table is the same one that my grandparents had at their house when I was growing up (and quite a few years before I was born).  It's been a great table and expands from a 42\" circle all the way to 82\" after adding the leaves.  However it is now something like 60 years old and had definitely started to show its age.  On top of dings and dents the finish had started to get tacky and things would stick to it.</p>\n<p><img src=\"/posts/dining-table-refinish/old-finish-with-cookies.jpg\" alt=\"A wooden table set with baked cookies, a mixing bowl, and other baking supplies.\"></p>\n<h2>Temporary Table</h2>\n<p>While I hoped the stripping and refinishing process was going to be pretty quick I've done enough projects to know estimates are a joke and it inevitably would take two or three times as long as I planned.  Since this is our only proper dining space and we use it for breakfast pretty much every day I figured I should whip up a quick temporary table.  Perhaps I overdid it but I just figured if I made a temporary table then the project would go quickly and if I threw a board on some sawhorses it would end up taking months.</p>\n<p><img src=\"/posts/dining-table-refinish/temporary-table.jpg\" alt=\"An oval plywood tabletop on sawhorses sits in a messy workshop with various supplies around it.\" title=\"Temporary Tabl\"></p>\n<h2>Breaking it Down</h2>\n<p>Started with just pulling it all apart taking off the apron and hardware.</p>\n<p><img src=\"/posts/dining-table-refinish/underside-half-stripped.jpg\" alt=\"A round wooden table with metal brackets and hardware is disassembled on a wooden pallet.\">\n<img src=\"/posts/dining-table-refinish/underside-no-hardware.jpg\" alt=\"Two halves of a wooden table top sit on sawhorses in a garage or workshop.\"></p>\n<p>The apron had some very dated decorative trim on it that had accumulated a lot of grime over the years and also had started cracking off.  Rather than trying to patch it and strip it I decided to just remove it entirely.  Cleans the lines up a bit and simplified the refinishing process quite a bit.</p>\n<p><img src=\"/posts/dining-table-refinish/apron-not-stripped.jpg\" alt=\"Two curved wooden pieces rest on a workbench beside a sander, indicating ongoing woodworking.\"></p>\n<p>There were a few spots (no pictures, sorry) where the apron cracked that I just had to patch with woodfiller.  I could've re-veneered it but that seemed like overkill and wouldn't have matched anyway.</p>\n<h2>Stripping and Sanding</h2>\n<p>Once I had it all broken down, the apron details removed, and cracks patched it was time for getting rid of that old finish.  I used a bunch of <a href=\"https://citristrip.com/\">Citristrip</a> as the first couple rounds of removing all that finish and grime.  Once that was scraped off I got going on sanding using 60, 120, and 220 grit as things progressed.  The color change is pretty dramatic!</p>\n<p><img src=\"/posts/dining-table-refinish/legs-one-stripped.jpg\" alt=\"Four pieces of cut wood, three stained and one not, lay on a work bench.\"></p>\n<p>As things progressed I also used my <a href=\"https://www.rockler.com/rockler-circle-cutting-jig\">Rockler Circle Cutting Jig</a> to remove the dated <a href=\"https://en.wikipedia.org/wiki/Ogee\">ogee profile</a> on the ends and just ripped it off with a circular saw for the leaves.  Then it was just sanding, sanding, sanding!</p>\n<p><img src=\"/posts/dining-table-refinish/midway-progress.jpg\" alt=\"An unfinished oval wooden table on a stand in a cluttered garage workshop area.\">\n<img src=\"/posts/dining-table-refinish/sanding-complete.jpg\" alt=\"Several wood boards and shapes on a work bench, with various tools in the background.\"></p>\n<h2>Finished Up</h2>\n<p>After the sanding was finally done it was time for finishing it up.  After some color and finish testing trials I landed on <a href=\"https://varathanestain.com/varathane-water-based-polyurethane/\">Water-based Varathane Polyurethane</a>.  Offered a nice easy application process and kept the table from ending up too yellow.</p>\n<p><img src=\"/posts/dining-table-refinish/finish-applied.jpg\" alt=\"A disassembled wooden table with three removable leaves in front of a blue car.\"></p>\n<p>Once that was all applied, sanded, and dried it was time to get it put back into the kitchen!  Looks pretty great I think although now I want to redo the floors as it kind of blends in a bit too much.  Oh well, that's for another day!</p>\n<p><img src=\"/posts/dining-table-refinish/finished-top-view.jpg\" alt=\"A round wooden table is shown with a white chair underneath it.\">\n<img src=\"/posts/dining-table-refinish/complete-and-reinstalled.jpg\" alt=\"An oval wooden dining table with three white chairs pushed in around it.\"></p>\n","slug":"/posts/dining-table-refinish"},{"slugPartial":"aws-bedrock-exploration","filename":"aws-bedrock-exploration.md","title":"AWS Bedrock Exploration","excerpt":"Figured I should dive into AWS Bedrock, see how it works, and explore the capabilities of the models they have.  ","date":"2025-05-18","categories":["cloud tech","development"],"ogImage":{"url":"posts/posts/thumbnail.jpg"},"images":[],"content":"<p>I've never had a situation at work that's driven me to get into Bedrock but it's long overdue.  I created a <a href=\"https://github.com/arsdehnel/bedrock-exploration\">quick repo</a> to play around with it, capture some scripts, and see where it led.  It was my first real development calling models in a way that would be used for anything semi-real.  I'd done some scripts and <code>curl</code> commands to call chatGPT and all that but this had a bit more purpose behind it.</p>\n<h2>Initial Experience</h2>\n<p>The very first thing you have to do in the console is follow a couple ClickOps things to enable access to the models which is a little awkward.  I get why it needs to be there to avoid accidental spend on a model that could cost a lot of money but it's not the easiest onboarding experience especially because of how the AWS console continues to struggle with good UX.</p>\n<p>After that the experience was actually pretty good.  Once you have a model you can use (the access is granted immediately after finding the flow to request it) there is a playground setup that makes it very easy to interact with them.  This is similar to other AI model interactions, they didn't invent anything new here but also didn't try to be clever like AWS sometimes does.</p>\n<p>Within a few minutes I had a model setup and was making the requests I needed to prove out the use cases I had in mind.  This was easier than I expected and rather pleasant.  I was fooled into thinking this was going to be flawless exploration 😉.</p>\n<h2>Moving to the SDK</h2>\n<p>At this point I figured I was ready to take those clicks I was doing in the console and turn them into some SDK calls.  Being the JavaScript developer that I am I created a <code>git</code> repo and installed <a href=\"https://docs.aws.amazon.com/AWSJavaScriptSDK/v3/latest/Package/-aws-sdk-client-bedrock-runtime/\">the AWS SDK for Bedrock Runtime</a>.  So far so good.</p>\n<p>However moving on to the <a href=\"https://docs.aws.amazon.com/AWSJavaScriptSDK/v3/latest/Package/-aws-sdk-client-bedrock-runtime/Interface/InvokeModelCommandInput/\">Invoke Model Command</a> and it's only input the <a href=\"https://docs.aws.amazon.com/AWSJavaScriptSDK/v3/latest/Package/-aws-sdk-client-bedrock-runtime/Interface/InvokeModelCommandInput/\">Invoke Model Command Input</a> I hit my first stumbling block.  There is essentially no documentation for this method.  Since this is AWS I just figured it wasn't in the SDK docs but that it was somewhere on the internet.</p>\n<p>I was wrong.</p>\n<p>Since Bedrock is just a system that runs a variety of models for you the runtime SDK is essentially just an AWS authentication wrapper on the models themselves.  So every model takes a different input and even within models your input might need to be different based on what you are trying to do.  That totally makes sense in hindsight but compared to essentially any other AWS service I've used it's not how they work.  And there doens't seem to be any indication of this anywhere in their docs.  No pointers to suggest that each model is different and you should refer to the docs of that model instead of anything within AWS. Maybe people more familiar with the AI/Model space would know this more readily but I sure didn't and it got quite frustrating.</p>\n<h2>Initial Scripts</h2>\n<p>Once I got past that stumbling block I got things scripted out pretty easily.  The <code>Model ID</code> the API requires isn't <em>quite</em> what the console provides but you just need to prefix the provided ID with <code>us.</code> and things work.  Another undocumented thing but not the worst thing to struggle through.</p>\n<p>My first few things were based roughly on asks from the business at work.  While this wasn't on the clock work or even things we were being directly asked to do they were real requirements that I could easily script for to help me figure out how to use Bedrock.</p>\n<ol>\n<li>Alt Text Generation: give a model an image and get back a description of the image to be used as Alt Text to improve the accessibility of our site.</li>\n<li>Ecard Generator: we have a mechanism for sending ecards to coworkers on our site so having AI generate a card for you right in the system seemed pretty handy.</li>\n<li>Enhance: generic AI text interaction where it can take something you wrote and make it more professional or heart-felt (ironically).</li>\n</ol>\n<h2>Final Thoughts</h2>\n<p>While these were pretty simple use cases and all are done with prebuilt models it was a good toe-dipping exercise.  While I had some frustration with the AWS API I still was able to get something useful and learn a fair bit about how Bedrock works and where it could be useful.  I'm sure it's not always the most efficient method for running models but it sure is easy and I'm not going to stand up my own model for home projects so having something that's super easy to use and can be baked right into the rest of my infrastructure bill is a welcome option.</p>\n","slug":"/posts/aws-bedrock-exploration"}],"categories":["book","camping","cloud tech","development","wood"]},"__N_SSG":true}