{
    "posts/camping-car-storage/drawers-prototype.jpg": "The back of an SUV with a Coleman cooler and two crates in the trunk.",
    "posts/camping-car-storage/initial-prototype.jpg": "A black SUV's trunk is open, showing a cooler and two wooden crates inside.",
    "posts/camping-car-storage/realish-drawers.jpg": "The back of an SUV with a Coleman cooler and various camping supplies on display.",
    "posts/dining-table-refinish/apron-not-stripped.jpg": "Two curved wooden pieces rest on a workbench beside a sander, indicating ongoing woodworking.",
    "posts/dining-table-refinish/complete-and-reinstalled.jpg": "An oval wooden dining table with three white chairs pushed in around it.",
    "posts/dining-table-refinish/finish-applied.jpg": "A disassembled wooden table with three removable leaves in front of a blue car.",
    "posts/dining-table-refinish/finished-top-view.jpg": "A round wooden table is shown with a white chair underneath it.",
    "posts/dining-table-refinish/legs-one-stripped.jpg": "Four pieces of cut wood, three stained and one not, lay on a work bench.",
    "posts/dining-table-refinish/midway-progress.jpg": "An unfinished oval wooden table on a stand in a cluttered garage workshop area.",
    "posts/dining-table-refinish/old-finish-with-cookies.jpg": "A wooden table set with baked cookies, a mixing bowl, and other baking supplies.",
    "posts/dining-table-refinish/sanding-complete.jpg": "Several wood boards and shapes on a work bench, with various tools in the background.",
    "posts/dining-table-refinish/temporary-table.jpg": "An oval plywood tabletop on sawhorses sits in a messy workshop with various supplies around it.",
    "posts/dining-table-refinish/thumbnail.jpg": "A round wood table with three chairs is placed in a messy dining room.",
    "posts/dining-table-refinish/underside-half-stripped.jpg": "A round wooden table with metal brackets and hardware is disassembled on a wooden pallet.",
    "posts/dining-table-refinish/underside-no-hardware.jpg": "Two halves of a wooden table top sit on sawhorses in a garage or workshop."
}